YoungSooBae1224/SensorShield-EVK-003-nRF52/BH1749NUC/main.c
uint8_t tx_flag = 0;

/**@brief Platform functions used by the sensor driver(s).
 *
 * @details Entry point for the platform specific features such as TWI.
 */
struct platform_functions nrf52_funcs;


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Send data to tx link */
void ble_uart_tx(uint8_t * data, uint16_t size) {
    
    ret_code_t ret;
#if 0
    NRF_LOG_INFO("ble_uart_tx: ");
    NRF_LOG_HEXDUMP_INFO(p_string, *p_length);
    NRF_LOG_INFO("\r\n");
#endif
    if(m_conn_handle != BLE_CONN_HANDLE_INVALID && tx_flag == 1)
    {
        do
        {
            ret = ble_nus_data_send(&m_nus,data,&size,m_conn_handle);
            if(ret != NRF_SUCCESS)
            {
                NRF_LOG_INFO("%s err=%d\r\n", __func__, ret);
            }
            if ((ret != NRF_ERROR_INVALID_STATE) &&
                (ret != NRF_ERROR_RESOURCES) &&
                (ret != NRF_ERROR_NOT_FOUND) &&
                (ret != BLE_ERROR_GATTS_SYS_ATTR_MISSING))
            {
                APP_ERROR_CHECK(ret);
            }
        } while (ret == NRF_ERROR_RESOURCES);
    }
}


static void repeated_timer_handler(void * p_context)
{
    uint8_t data[10], size;
    uint16_t data_16[5];
    char tr_data[256] = {0,};
    char r_char[20] = {0,};
    char g_char[20] = {0,};
    char b_char[20] = {0,};
    char ir_char[20] = {0,};

    BH1749NUC_get_raw(data,&size);
    data_16[0] = data[0]|(data[1]<<8);
    data_16[1] = data[2]|(data[3]<<8);
    data_16[2] = data[4]|(data[5]<<8);
    data_16[3] = data[6]|(data[7]<<8);
    data_16[4] = data[8]|(data[9]<<8);

    //NRF_LOG_INFO( "RED %5d / GREEN %5d / BLUE %5d / IR %5d / GREEN2 %5d",
    //(data_16[0]/82.0)*20,(data_16[1]/114.0)*20,(data_16[2]/81.0)*20,(data_16[3]/32.0)*20,(data_16[4]/114)*20);

    sprintf(r_char,NRF_LOG_FLOAT_MARKER,NRF_LOG_FLOAT((data_16[0]/82.0)*20.0));
    sprintf(g_char,NRF_LOG_FLOAT_MARKER,NRF_LOG_FLOAT(((data_16[1]+data_16[4])/228.0)*20.0));
    sprintf(b_char,NRF_LOG_FLOAT_MARKER,NRF_LOG_FLOAT((data_16[2]/81.0)*20.0));
    sprintf(ir_char,NRF_LOG_FLOAT_MARKER,NRF_LOG_FLOAT((data_16[3]/32.0)*20.0));

    sprintf(tr_data,"%s/%s/%s/%s",r_char,g_char,b_char,ir_char);
    NRF_LOG_INFO("%s",NRF_LOG_PUSH(tr_data));

    int cnt;
    for(cnt = 0 ; cnt < 256 ; cnt++)
    {
        if(tr_data[cnt] == 0)
        {
            break;
        }
    }
    ble_uart_tx((uint8_t *)tr_data, cnt);
}


/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_repeated_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                repeated_timer_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_repeated_timer_id, APP_TIMER_TICKS(500), NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{
    if(p_evt->type == BLE_NUS_EVT_COMM_STARTED) {
        tx_flag = 1;
    }else if(p_evt->type == BLE_NUS_EVT_RX_DATA){
        // do nothing        
    } else if(p_evt->type == BLE_NUS_EVT_TX_RDY){
        // SD TX buffers are free
        NRF_LOG_INFO("%s TX complete\r\n", __func__);
        //tx_flag = 0;
    }
}
/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize NUS.
    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

